app/Controllers/CaisseController.php

SELECT *
FROM `caisse`
---
    public function choix(){
        $model = new CaisseModel();
        $caisses = $model->findAll();