app/Controllers/ProduitPdf.php

SELECT *
FROM `produit`
---
    public function generate() {

        $model = new ProduitModel();
        $produits = $model->findAll();