app/Controllers/ProduitCsv.php

INSERT INTO `achat` (`id_client`, `id_caisse`, `id_caissier`, `date_achat`, `statut`) VALUES (1, 1, 1, '2026-07-01 10:30:00', 'cloture')
---
            // Creer l'achat
            // Il faut un achat unique donc on regarde si il n existe pas encore dans achat
            if (!isset($achats[$csvAchatId])) {
                $achatModel->insert([
                    'id_client'    => $client['id_client'],
                    'id_caisse'    => $caisse['id_caisse'],
                    'id_caissier'  => $caissier['id_caissier'],
                    'date_achat'   => $date,
                    'statut'       => $statut
                ]);