app/Models/CaissierModel.php

    public function getCaissierByEmail($email){
        return $this->where('email', $email)->first();
---
SELECT *
FROM `caissier`
WHERE `email` = 'caissier@gmail.com'
 LIMIT 1