app/Models/CaisseModel.php

    public function findByNumero($numero)
    {
        return $this->where('numero', $numero)->first();
---
SELECT *
FROM `caisse`
WHERE `numero` = '1'
 LIMIT 1