app/Models/ClientModel.php

SELECT *
FROM `client`
WHERE `nom` = 'Jean Dupont'
 LIMIT 1
---
    public function findByNom($nom)
    {
        return $this->where('nom', $nom)->first();