app/Models/ProduitModel.php

SELECT *
FROM `produit`
WHERE `designation` = 'Biscuit'
 LIMIT 1
---
    public function findByDesignation($designation)
    {
        return $this->where('designation', $designation)->first();